// #qLQLJSeN7i
//
// – є масив [2,17,13,6,22,31,45,66,100,-18] :
//
// 1. перебрати його циклом while
//
//     2. перебрати його циклом for
//
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
//
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
//
// 5. перебрати циклом while та вивести  числа тільки парні  значення
//
// 6. перебрати циклом for та вивести  числа тільки парні  значення
//
// 7. замінити кожне число, кратне 3, на слово “okten”
//
// 8. вивести масив у зворотньому порядку.
//
// 9. всі попередні завдання (окрім 8), але у зворотньому циклі (задом наперед)

let arr = [2,17,13,6,22,31,45,66,100,-18];


// 1. перебрати його циклом while
let i = 0;
while (i < arr.length) {
    console.log(arr[i]);
    i++;
}

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом

let i = 0;

while (i < arr.length) {
    if (arr[i] %2 !== 0) {
        console.log(arr[i]);
    }
    i++;
}

// 5. перебрати циклом while та вивести  числа тільки парні  значення

let i = 0;
while (i < arr.length) {
    if (arr[i] %2 === 0) {
        console.log(arr[i]);
    }
    i++;
}
