// #qLQLJSeN7i
//
// – є масив [2,17,13,6,22,31,45,66,100,-18] :
//
// 1. перебрати його циклом while
//
//     2. перебрати його циклом for
//
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
//
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
//
// 5. перебрати циклом while та вивести  числа тільки парні  значення
//
// 6. перебрати циклом for та вивести  числа тільки парні  значення
//
// 7. замінити кожне число, кратне 3, на слово “okten”
//
// 8. вивести масив у зворотньому порядку.
//
// 9. всі попередні завдання (окрім 8), але у зворотньому циклі (задом наперед)


// 1. перебрати його циклом while
let arr = [2,17,13,6,22,31,45,66,100,-18];
let i = 0;
while (i < arr.length) {
    console.log(arr[i]);
    i++;
}
//     2. перебрати його циклом for
let arr = [2,17,13,6,22,31,45,66,100,-18];
  for (let i = 0; i <arr.length; i++) {
      console.log(arr[i]);
  }

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
let arr = [2,17,13,6,22,31,45,66,100,-18];
let i = 0;

while (i < arr.length) {
    if (arr[i] %2 !== 0) {
        console.log(arr[i]);
    }
    i++;
}
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
let arr = [2,17,13,6,22,31,45,66,100,-18];
for (let i =0; i < arr.length; i++) {
    if (arr[i] %2 !== 0) {
        console.log(arr[i]);
    }
}

// 5. перебрати циклом while та вивести  числа тільки парні  значення
let arr = [2,17,13,6,22,31,45,66,100,-18];
let i = 0;
while (i < arr.length) {
    if (arr[i] %2 === 0) {
        console.log(arr[i]);
    }
    i++;
}

// 6. перебрати циклом for та вивести  числа тільки парні  значення
let arr = [2,17,13,6,22,31,45,66,100,-18];
for (let i =0; i < arr.length; i++) {
    if (arr[i] %2 === 0) {
        console.log(arr[i]);
    }
}
// 7. замінити кожне число, кратне 3, на слово “okten”

let arr = [2,17,13,6,22,31,45,66,100,-18];
for (let i = 0; i < arr.length; i++) {
    if (arr[i] %3 === 0) {
        arr[i] = "okten";
    }
}

// 8. вивести масив у зворотньому порядку.
let arr = [2,17,13,6,22,31,45,66,100,-18];
for (let i =arr.length -1; i >= 0; i--) {
    console.log(arr[i]);
}
// 9. всі попередні завдання (окрім 8), але у зворотньому циклі (задом наперед)

